// № 1

// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

//==============================================
const firstNumber = prompt('Enter a number');
let number = Number(firstNumber);
if (number === 10) {
    alert('Вірно');
} else {
    alert('Не вірно')
    
}
//===============================================

// №2

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);
//===============================================

const min = Math.floor(Math.random() * (59 - 0) + 0);


if (0 <= min && min <= 14) {
    alert(`${min} - 1 quarter`);
} else if(15 <= min && min <= 29) {
    alert(`${min} - 2 quarter`);
} else if(30 <= min && min <= 44) {
    alert(`${min} - 3 quarter`);
} else if(45 <= min && min <= 59) {
    alert(`${min} - 4 quarter`);
}
//---------------------------------------------

// Не справилась с синтаксисом :(((  else if(45 <= min <= 59)==> было неправильно!!!
//                                   else if(45 <= min && min <= 59) ==> Так правильно!!!
//===================================================

// №3

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

//=================================================

const numberPeople = prompt('Enter a number from 1 to 4');
let result = Number(numberPeople); //
switch (result){
    case 1:
       console.log('winter');
    break;
    case 2:
        console.log('spring');
     break;
    case 3:
        console.log('summer');
     break;
    case 4:
        console.log('outumn');
     break;
         default:
      console.log('Sorry but you a namber enter from  1 to 4');
  }
//=======================================================

// №4
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

//=====================================================

const numberUserMinutes = Number(prompt('Enter you time'));

function formattime(totalMinutes) {

    const hours = Math.floor(totalMinutes / 60);
    const modHours = String(hours).padStart(2, 0);
    const minutes = totalMinutes % 60;
    const modMinutes = String(minutes).padStart(2, 0);
    return `${modHours}:${modMinutes}`;
}
console.log(formattime(numberUserMinutes));


//=================================================
// №5

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

//=============================================


const userLogin = prompt("Введіть логін");
console.log(userLogin);

if (userLogin === "Адмін") {
  const userPassword = prompt("Введіть пароль");

  if (userPassword === null || userPassword === "") {
    alert("Скасовано");
  } else if (userPassword === "Я головний") {
    alert("Добрий день!");
  } else {
    alert("Невірний пароль!");
  }

} else if (userLogin === null || userLogin === "") {
  alert("Скасовано");
} else {
  alert("Я вас не знаю");
}

//========================================
// №6  
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.
//==============================================
let numberLich = 0;
while (numberLich <= 20) {
    console.log(numberLich);
    numberLich++;
}

//--------------------------
// function isEven(n) {
//   return n % 2 === 0 ? "чётное" : "нечётное";
// }